<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"434e02c193914b40eb9d14b14c42527ff6efa8b06da956e203d264bb4b71ec7b","plan_job_ref":"Job Terraform Plan AWS Infrastructure #7 at https://github.com/nguyen2v/caremate-devops/actions/runs/22817749845","plan_out_hash":"49846a20abd7388c1e7d43911392e6ac4b870e011858a86620ad0f1f49d97059","plan_hash":"2c9361495529a32dad39df425abdbd9503ffc1c34d69f7d18580954e3c37d8fb","plan_text_format":"diff","version":"2.2.3"} -->
Terraform plan in __terraform/aws__
<details>
<summary>Plan: 6 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # aws_security_group.eks_nodes will be updated in-place
!~  resource "aws_security_group" "eks_nodes" {
        id                     = "sg-004ab6e9d931276ff"
!~      ingress                = [
-           {
-               cidr_blocks      = []
-               description      = "HTTP from ALB"
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = [
-                   "sg-0bf015abf30872032",
                ]
-               self             = false
-               to_port          = 65535
            },
#            (1 unchanged element hidden)
        ]
        name                   = "caremate-dev-sg-eks-nodes-01"
        tags                   = {
            "AutoDisable"                               = "Yes"
            "CostCenter"                                = "GHC.FHS"
            "Environment"                               = "Dev"
            "ManagedBy"                                 = "terraform"
            "Name"                                      = "caremate-dev-sg-eks-nodes-01"
            "Owner"                                     = "GHC.FHS"
            "Project"                                   = "Caremate"
            "Team"                                      = "Caremate-Devops"
            "kubernetes.io/cluster/caremate-dev-eks-01" = "owned"
        }
#        (8 unchanged attributes hidden)
    }

  # module.eks.aws_eks_access_policy_association.this["github_actions_admin"] will be created
+   resource "aws_eks_access_policy_association" "this" {
+       associated_at = (known after apply)
+       cluster_name  = "caremate-dev-eks-01"
+       id            = (known after apply)
+       modified_at   = (known after apply)
+       policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
+       principal_arn = "arn:aws:iam::065104126125:role/caremate-dev-github-terraform-01"

+       access_scope {
+           type = "cluster"
        }
    }

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "aws-ebs-csi-driver"
+       addon_version               = "v1.56.0-eksbuild.1"
+       arn                         = (known after apply)
+       cluster_name                = "caremate-dev-eks-01"
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       service_account_role_arn    = "arn:aws:iam::065104126125:role/caremate-dev-eks-ebs-csi-driver-01"
+       tags                        = {
+           "AutoDisable" = "Yes"
+           "CostCenter"  = "GHC.FHS"
+           "Environment" = "Dev"
+           "ManagedBy"   = "terraform"
+           "Name"        = "caremate-dev-eks-01"
+           "Owner"       = "GHC.FHS"
+           "Project"     = "Caremate"
+           "Team"        = "Caremate-Devops"
        }
+       tags_all                    = {
+           "AutoDisable" = "Yes"
+           "CostCenter"  = "GHC.FHS"
+           "Environment" = "Dev"
+           "ManagedBy"   = "terraform"
+           "Name"        = "caremate-dev-eks-01"
+           "Owner"       = "GHC.FHS"
+           "Project"     = "Caremate"
+           "Team"        = "Caremate-Devops"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "coredns"
+       addon_version               = "v1.11.4-eksbuild.28"
+       arn                         = (known after apply)
+       cluster_name                = "caremate-dev-eks-01"
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "AutoDisable" = "Yes"
+           "CostCenter"  = "GHC.FHS"
+           "Environment" = "Dev"
+           "ManagedBy"   = "terraform"
+           "Name"        = "caremate-dev-eks-01"
+           "Owner"       = "GHC.FHS"
+           "Project"     = "Caremate"
+           "Team"        = "Caremate-Devops"
        }
+       tags_all                    = {
+           "AutoDisable" = "Yes"
+           "CostCenter"  = "GHC.FHS"
+           "Environment" = "Dev"
+           "ManagedBy"   = "terraform"
+           "Name"        = "caremate-dev-eks-01"
+           "Owner"       = "GHC.FHS"
+           "Project"     = "Caremate"
+           "Team"        = "Caremate-Devops"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "kube-proxy"
+       addon_version               = "v1.29.15-eksbuild.31"
+       arn                         = (known after apply)
+       cluster_name                = "caremate-dev-eks-01"
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "AutoDisable" = "Yes"
+           "CostCenter"  = "GHC.FHS"
+           "Environment" = "Dev"
+           "ManagedBy"   = "terraform"
+           "Name"        = "caremate-dev-eks-01"
+           "Owner"       = "GHC.FHS"
+           "Project"     = "Caremate"
+           "Team"        = "Caremate-Devops"
        }
+       tags_all                    = {
+           "AutoDisable" = "Yes"
+           "CostCenter"  = "GHC.FHS"
+           "Environment" = "Dev"
+           "ManagedBy"   = "terraform"
+           "Name"        = "caremate-dev-eks-01"
+           "Owner"       = "GHC.FHS"
+           "Project"     = "Caremate"
+           "Team"        = "Caremate-Devops"
        }

+       timeouts {}
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
+   resource "aws_eks_addon" "this" {
+       addon_name                  = "vpc-cni"
+       addon_version               = "v1.21.1-eksbuild.3"
+       arn                         = (known after apply)
+       cluster_name                = "caremate-dev-eks-01"
+       configuration_values        = (known after apply)
+       created_at                  = (known after apply)
+       id                          = (known after apply)
+       modified_at                 = (known after apply)
+       preserve                    = true
+       resolve_conflicts_on_create = "OVERWRITE"
+       resolve_conflicts_on_update = "OVERWRITE"
+       tags                        = {
+           "AutoDisable" = "Yes"
+           "CostCenter"  = "GHC.FHS"
+           "Environment" = "Dev"
+           "ManagedBy"   = "terraform"
+           "Name"        = "caremate-dev-eks-01"
+           "Owner"       = "GHC.FHS"
+           "Project"     = "Caremate"
+           "Team"        = "Caremate-Devops"
        }
+       tags_all                    = {
+           "AutoDisable" = "Yes"
+           "CostCenter"  = "GHC.FHS"
+           "Environment" = "Dev"
+           "ManagedBy"   = "terraform"
+           "Name"        = "caremate-dev-eks-01"
+           "Owner"       = "GHC.FHS"
+           "Project"     = "Caremate"
+           "Team"        = "Caremate-Devops"
        }

+       timeouts {}
    }

  # module.vpc.aws_vpc.this[0] (deposed object cc2f337f) will be destroyed
  # (left over from a partially-failed replacement of this instance)
-   resource "aws_vpc" "this" {
-       arn                                  = "arn:aws:ec2:ap-southeast-1:065104126125:vpc/vpc-00ef8979b870fa6a8" -> null
-       assign_generated_ipv6_cidr_block     = false -> null
-       cidr_block                           = "10.0.0.0/16" -> null
-       default_network_acl_id               = "acl-07a4318dd47b7d361" -> null
-       default_route_table_id               = "rtb-0e11dd2be55e25029" -> null
-       default_security_group_id            = "sg-0a20f81c95ad1ee2f" -> null
-       dhcp_options_id                      = "dopt-0dcff28671d9658ea" -> null
-       enable_dns_hostnames                 = true -> null
-       enable_dns_support                   = true -> null
-       enable_network_address_usage_metrics = false -> null
-       id                                   = "vpc-00ef8979b870fa6a8" -> null
-       instance_tenancy                     = "default" -> null
-       ipv6_netmask_length                  = 0 -> null
-       main_route_table_id                  = "rtb-0e11dd2be55e25029" -> null
-       owner_id                             = "065104126125" -> null
-       tags                                 = {
-           "AutoDisable" = "Yes"
-           "CostCenter"  = "GHC.FHS"
-           "Environment" = "Dev"
-           "ManagedBy"   = "terraform"
-           "Name"        = "caremate-dev-vpc-01"
-           "Owner"       = "GHC.FHS"
-           "Project"     = "Caremate"
-           "Team"        = "Caremate-Devops"
        } -> null
-       tags_all                             = {
-           "AutoDisable" = "Yes"
-           "CostCenter"  = "GHC.FHS"
-           "Environment" = "Dev"
-           "ManagedBy"   = "terraform"
-           "Name"        = "caremate-dev-vpc-01"
-           "Owner"       = "GHC.FHS"
-           "Project"     = "Caremate"
-           "Team"        = "Caremate-Devops"
        } -> null
#        (4 unchanged attributes hidden)
    }

  # module.eks.module.eks_managed_node_group["general"].aws_eks_node_group.this[0] will be created
+   resource "aws_eks_node_group" "this" {
+       ami_type               = (known after apply)
+       arn                    = (known after apply)
+       capacity_type          = "SPOT"
+       cluster_name           = "caremate-dev-eks-01"
+       disk_size              = (known after apply)
+       id                     = (known after apply)
+       instance_types         = [
+           "t3.small",
        ]
+       labels                 = {
+           "Environment" = "Dev"
+           "NodeGroup"   = "general"
        }
+       node_group_name        = (known after apply)
+       node_group_name_prefix = "caremate-dev-ng-gen-01-"
+       node_role_arn          = "arn:aws:iam::065104126125:role/caremate-dev-ng-gen-01-eks-node-group-20260308050334162400000009"
+       release_version        = (known after apply)
+       resources              = (known after apply)
+       status                 = (known after apply)
+       subnet_ids             = [
+           "subnet-039b63416ee353217",
+           "subnet-05b2cd74a86ba7a90",
        ]
+       tags                   = {
+           "AutoDisable" = "Yes"
+           "CostCenter"  = "GHC.FHS"
+           "Environment" = "Dev"
+           "ManagedBy"   = "terraform"
+           "Name"        = "caremate-dev-ng-gen-01"
+           "Owner"       = "GHC.FHS"
+           "Project"     = "Caremate"
+           "Team"        = "Caremate-Devops"
        }
+       tags_all               = {
+           "AutoDisable" = "Yes"
+           "CostCenter"  = "GHC.FHS"
+           "Environment" = "Dev"
+           "ManagedBy"   = "terraform"
+           "Name"        = "caremate-dev-ng-gen-01"
+           "Owner"       = "GHC.FHS"
+           "Project"     = "Caremate"
+           "Team"        = "Caremate-Devops"
        }
+       version                = "1.29"

+       launch_template {
+           id      = "lt-0b0efaa591c9187ee"
+           name    = (known after apply)
+           version = "1"
        }

+       node_repair_config (known after apply)

+       scaling_config {
+           desired_size = 1
+           max_size     = 3
+           min_size     = 1
        }

+       timeouts {}

+       update_config {
+           max_unavailable_percentage = 33
        }
    }

Plan: 6 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan AWS Infrastructure #7](https://github.com/nguyen2v/caremate-devops/actions/runs/22817749845)